Repository: AndreaNicola/arasaac_translator
Catalog: lib/l10n/app_*.arb
Languages: it

# about
source: About ARASAAC Translator
it: Informazioni su ARASAAC Translator

# aboutText
source: ARASAAC Translator is a free tool to translate text to pictograms. It uses the ARASAAC pictogram set, which is licensed under Creative Commons BY-NC-SA 3.0. You can find more information about ARASAAC at http://arasaac.org
it: ARASAAC Translator è uno strumento gratuito per tradurre il testo in pittogrammi. Utilizza il set di pittogrammi ARASAAC, che è concesso in licenza sotto Creative Commons BY-NC-SA 3.0. Puoi trovare ulteriori informazioni su ARASAAC su http://arasaac.org

# areYouSure
source: Are you sure you want to delete this translation?
it: Sei sicuro di voler cancellare questa traduzione?

source: Cancel
it: Annulla

source: Confirm
it: Conferma

# confirmCustomPictogramDeleteText
source: Are you sure you want to delete this custom pictogram?
it: Sei sicuro di voler cancellare questo pittogramma personalizzato?

# confirmCustomPictogramDeleteTitle
source: Delete custom pictogram
it: Cancella il pittogramma personalizzato

# confirmCustomPictogramSaveOverwrite
source: This action is going to overwrite the existing custom pictogram.
it: Questa azione sovrascriverà il pittogramma già esistente per questa parola

# confirmCustomPictogramSaveText
source: Are you sure you want to save this pictogram as a new custom pictogram?
it: Sei sicuro di voler salvare questo pittogramma personalizzato?

# confirmCustomPictogramSaveTitle
source: Save custom pictogram
it: Salva il pittogramma personalizzato

source: Custom pictograms
it: Pittogrammi personalizzati

source: Delete
it: Cancella

source: Edit text
it: Modifica il testo

# enterText
source: Enter text to translate
it: Inserisci il testo da tradurre

source: Loaded from:
it: Caricato da:

source: New custom pictogram
it: Nuovo pittogramma personalizzato

# newCustomPictogramKey
source: New custom pictogram word
it: Inserisci la parola del nuovo pittogramma

# noCustomPictograms
source: You don''t have any custom pictogram yet
it: Non hai ancora inserito pittogrammi personalizzati

# noSavedTranslations
source: You don''t have any saved translation yet
it: Non hai ancora salvato nessuna traduzione

source: Save
it: Salva

# saveTranslationName
source: Save translation as...
it: Salva la traduzione come...

source: Saved translations
it: Traduzioni salvate

# title
source: ARASAAC translator
it: Traduttore ARASAAC

source: Edit custom pictogram
it: Modifica il pittogramma personalizzato

source: Edit pictogram
it: Modifica il pittogramma

# appGuide
source: User guide
it: Guida all''uso

# appGuideIntroduction
source: The app provides three main functionalities:
it: L’app mette a disposizione tre funzionalità principali:

# appGuideFunctions1
source: Translate a natural language sentence into a sequence of ARASAAC pictograms.
it: Tradurre una frase in linguaggio naturale in una sequenza di pittogrammi arasaac.

# appGuideFunctions2
source: Manage a set of custom pictograms.
it: Gestire un insieme di pittogrammi personalizzati.

# appGuideFunctions3
source: Save and load already made translations.
it: Salvare e caricare traduzioni già fatte.

# appGuideFunctions4
source: Create a printable PDF with the pictograms we have composed.
it: Creare un PDF stampabile con i pittogrammi che abbiamo composto.

# appGuideFunctions1Step1
source: Open the app and on the home screen you will find a text field where you can write the sentences to translate.
it: Apri l’app e sulla home troverai un campo di testo in cui scrivere le frasi da tradurre.

# appGuideFunctions1Step2
source: Enter the sentence you want to translate into the text field.
it: Inserisci la frase che desideri tradurre nel campo di testo.

# appGuideFunctions1Step3
source: Wait a few seconds and your sentence will be translated into a sequence of ARASAAC pictograms.
it: Attendi qualche secondo e la tua frase verrà tradotta in una sequenza di pittogrammi arasaac.

# appGuideFunctions1Sub1
source: Merge two or more pictograms
it: Unire due o più pittogrammi

# appGuideFunctions1Sub1Introduction
source: To merge two pictograms you can drag one pictogram onto another:
it: Per unire due pittogrammi puoi trascinare un pittogramma su un altro:

# appGuideFunctions1Sub1Step1
source: the image of the target pictogram will be preserved
it: verrà conservata l’immagine del pittogramma di destinazione

# appGuideFunctions1Sub1Step2
source: the text of the pictogram will be the combination of the two pictograms.
it: il testo del pittogramma sarà la combinazione di quello dei due pittogrammi.

# appGuideFunctions1Sub2
source: Edit the text of a pictogram
it: Modificare il testo di un pittogramma

# appGuideFunctions1Sub2Introduction
source: Tap a pictogram to open a window that allows you to edit its text
it: Tocca un pittogramma per aprire una finestra che consente di modificarne il testo

# appGuideFunction2Step1
source: In the “Custom Pictograms” section, click on the “Add” button to add a new custom pictogram.
it: Nella sezione “Pittogrammi personalizzati”, clicca sul pulsante “Aggiungi” per aggiungere un nuovo pittogramma personalizzato

# appGuideFunction2Step1Sub1
source: enter the text of the new pictogram
it: inserisci il testo del nuovo pittogramma

# appGuideFunction2Step1Sub2
source: choose whether to insert the image using the camera or directly from the device’s gallery.
it: scegli se inserire l’immagine utilizzando la fotocamera o direttemente dalla galleria del dispositivo

# appGuideFunction2Step2
source: You can edit existing pictograms by tapping on the pictogram to be edited.
it: Puoi modificare i pittogrammi esistenti tappando sul pittogramma da modificare

# appGuideFunction2Step3
source: You can delete existing pictograms by tapping on the “Delete” button of the pictogram to be deleted.
it: Puoi eliminare i pittogrammi esistenti tappando sul pulsante “Elimina” del pittogramma da eliminare.

# appGuideFunctions2Sub1
source: Save a customized version of an ARASAAC pictogram
it: Salvare una versione personalizzata di un pittogramma ARASAAC

# appGuideFunctions2Sub1Introduction
source: If you have edited the text of a pictogram, you can save it as a custom pictogram by long tapping on the pictogram. A confirmation message will appear asking you if you want to save the custom pictogram. If you confirm, the custom pictogram will be saved and you will be able to use it in the future.
it: Se hai modificato il testo di un pittogramma, puoi salvarlo come pittogramma personalizzato tappando a lungo sul pittogramma. Comparirà un messaggio di conferma che ti chiederà se vuoi salvare il pittogramma personalizzato. Se confermi, il pittogramma personalizzato verrà salvato e potrai utilizzarlo in futuro

# appGuideFunctions3Step1
source: In the “Translations” section, click on the “Save” button to save the current translation. You will be asked to enter a name for the translation. The translation will be saved and you will be able to load it in the future
it: Dopo aver tradotto una frase, puoi salvare la traduzione cliccando sul pulsante di salvataggio con l’icona del floppy disk.

# appGuideFunctions3Step2
source: You can load a saved translation in the “Translations” section by tapping on the translation to be loaded
it: Puoi visualizzare e caricare le traduzioni salvate nella sezione “Traduzioni salvate”.

# appGuideFunctions4Step1
source: After composing the sequence of pictograms, you can create a PDF by tapping on the “PDF” button. The PDF will be created and you will be able to print it or share it with other apps.
it: Dopo aver creato una traduzione è possibile creare un PDF stampabile/condivisibile utilizzando il pulsante con la stampante.

# appGuideFunctions4Step2
source: The app will produce a PDF with the translated text and the pictograms used
it: L’app produrrà un PDF con il testo tradotto e i pittogrammi utilizzati.

# appGuideFunctions4Step3
source: The file can be shared, saved or printed by interacting with the options of the operating system.
it: Il file può essere condiviso, salvato o stampato interagendo con le opzioni del sistema operativo
